app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 3
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 3
---
<h3>Comments</h3>
<% if @post.comments.empty? %>