app/controllers/comments_controller.rb

    def create
        @post = Post.find(params[:post_id])
        @comment = @post.comments.build(params[:comment])

        if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("author", "content", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Ciges"], ["content", "Segundo comentario"], ["created_at", Mon, 16 Jul 2012 16:01:20 CEST +02:00], ["post_id", 3], ["updated_at", Mon, 16 Jul 2012 16:01:20 CEST +02:00]]