app/controllers/posts_controller.rb

    def index
        # @posts = Post.published.order('created_at desc')
        @posts = Post.includes("author").published.order('created_at desc')
---
SELECT "posts".* FROM "posts" WHERE "posts"."published" = 't' ORDER BY created_at desc

    def show
        # @post = Post.find(params[:id])
        @post = Post.includes("author").find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]

    def create
        @post = Post.new(params[:post])
        @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)

    def update
        @post = Post.find(params[:id])

        if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "posts" SET "content" = 'Esto es una prueba de creación de un nuevo post.

    def destroy
        Post.find(params[:id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "7"]]